In [4]:
import pandas as pd
from sqlalchemy import create_engine
import os

### Extract CSVs into DataFrames

In [8]:
file_path_country = os.path.join("Data","country_codes.csv")

In [10]:
country_data = pd.read_csv(file_path_country)
country_data

,country_id,Common name,Official name,ISO3,continent,sub_region
0,1,Afghanistan,The Islamic Republic of Afghanistan,AFG,Asia,Southern Asia
1,2,Albania,the Republic of Albania,ALB,Europe,Southern Europe
2,3,Algeria,the People's Democratic Republic of Algeria,DZA,Africa,Northern Africa
3,4,Andorra,the Principality of Andorra,AND,Europe,Southern Europe
4,5,Angola,the Republic of Angola,AGO,Africa,Middle Africa
...,...,...,...,...,...,...
193,194,Yemen,the Republic of Yemen,YEM,Asia,Western Asia
194,195,Zambia,the Republic of Zambia,ZMB,Africa,Eastern Africa
195,196,Zimbabwe,the Republic of Zimbabwe,ZWE,Africa,Eastern Africa
196,197,Liechtenstein,Principality of Liechtenstein,LIE,Europe,Western Europe
197,198,Palestine,State of Palestine,PSE,Asia,Western Asia

In [4]:
sugar_data_melt =sugar_data.melt(['country_id'], var_name='year', value_name='value')
sugar_data_melt

                  Country  Year   Value
0             Afghanistan  1993    9.12
1                 Albania  1993   76.10
2                 Algeria  1993   74.30
3                  Angola  1993   25.30
4     Antigua and Barbuda  1993   82.20
...                   ...   ...     ...
3523            Venezuela  2013  106.00
3524              Vietnam  2013   27.40
3525                Yemen  2013   77.90
3526               Zambia  2013   28.10
3527             Zimbabwe  2013   80.60

[3528 rows x 3 columns]

In [5]:
sugar_data_melt = sugar_data_melt.set_index(['Country'])
sugar_data_melt

                     Year   Value
Country
Afghanistan          1993    9.12
Albania              1993   76.10
Algeria              1993   74.30
Angola               1993   25.30
Antigua and Barbuda  1993   82.20
...                   ...     ...
Venezuela            2013  106.00
Vietnam              2013   27.40
Yemen                2013   77.90
Zambia               2013   28.10
Zimbabwe             2013   80.60

[3528 rows x 2 columns]

In [8]:
#saving it into new file
sugar_data_melt.to_csv('sugar_data.csv')

### Transform premise DataFrame

### Transform county DataFrame

### Create database connection

In [ ]:
# Confirm tables

### Load DataFrames into database